<?php
    /*1. Сделайте функцию, которая возвращает куб числа. Число передается
параметром.*/
echo '---задание 1---';

function my_func_1($a){
    return $a * $a * $a;
}
echo '<p>' . my_func_1(2) . '</p>';
echo '<hr />';

/*2. Сделайте функцию, которая возвращает сумму двух чисел. Числа
передаются параметрами функции.*/
echo '---задание 2---';
function my_func_2($b,$c){
    return $b + $c;
}
echo '<p>' . my_func_2(2,2) . '</p>';
echo '<hr />';

/*3. Сделайте функцию, которая принимает параметром число от 1 до 7, а
возвращает день недели на русском языке.*/
echo '---задание 3---';
function day($num){
    $day = array('Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье');
    echo '<p>' . $day[$num-1] . '</p>';
    }
    echo day(2).'<br>'; 
echo '<hr />';

/*4.Сделайте функцию, которая параметром принимает число и проверяет -
отрицательное оно или нет. Если отрицательное - пусть функция вернет true,
а если нет - false.*/

echo '---задание 4---'.'<br>';

function my_func_4($a4) { 
  return ((int)$a4) ? 'true' : 'false';
} 
    echo my_func_4(-1);

    echo '<hr />';
/*5. Сделайте функцию getDigitsSum (digit - это цифра), которая параметром
принимает целое число и возвращает сумму его цифр.*/
echo '---задание 5---'.'<br>';
function getDigitsSum($a) {
    $num = "$a";
    $sum = 0;

    for ($i = 0; $i < strlen($num); $i++) {
        $sum += +$num[$i];
    }
    return $sum;
}

echo getDigitsSum(1999);
echo '<hr />';


/*6. Найдите все года от 1 до 2020, сумма цифр которых равна 13. Для этого
используйте вспомогательную функцию getDigitsSum из предыдущей задачи.*/
echo '---задание 6---'.'<br>';

for ($i = 1; $i <= 2020; $i++){
    if (getDigitsSum($i) == 13) 
    echo $i.' ';
    
}

echo '<hr />';
/*7. Сделайте функцию isEven() (even - это четный), которая параметром
принимает целое число и проверяет: четное оно или нет. Если четное - пусть
функция возвращает true, если нечетное - false.*/
echo '---задание 7---'.'<br>';
function isEven($num7){
if ($num7 % 2 == 0) {
    $num7 = (int)$num7;
    return 'true';
}
else {
    return 'false';  
}
} 
echo isEven(31);

echo '<hr />';

/*8. Сделайте функцию, которая принимает строку на русском языке, а
возвращает ее транслит.*/
echo '---задание 8---';
function translit($str8) {
    $rus = array('А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', 'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я');
    $lat = array('A', 'B', 'V', 'G', 'D', 'E', 'E', 'Gh', 'Z', 'I', 'Y', 'K', 'L', 'M', 'N', 'O', 'P', 'R', 'S', 'T', 'U', 'F', 'H', 'C', 'Ch', 'Sh', 'Sch', 'Y', 'Y', 'Y', 'E', 'Yu', 'Ya', 'a', 'b', 'v', 'g', 'd', 'e', 'e', 'gh', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'f', 'h', 'c', 'ch', 'sh', 'sch', 'y', 'y', 'y', 'e', 'yu', 'ya');
    return str_replace($rus, $lat, $str8);
  }
  echo '<p>' . translit("любое слово" . '</p>');
  echo '<hr />';

  /*9. Сделайте функцию, которая возвращает множественное или единственное
число существительного. Пример: 1 яблоко, 2 (3, 4) яблока, 5 яблок. Функция
первым параметром принимает число, а следующие 3 параметра — форма
для единственного числа, для чисел два, три, четыре и для чисел, больших
четырех, например, func(3, 'яблоко', 'яблока', 'яблок').*/
echo '---задание 9---'.'<br>';
function my_func_9($num, $str1, $str2, $str3)
{
    if ($num == 1) {
        return $num . ' ' . $str1;
    }
    if ($num >= 2 and $num <= 4) {
        return $num . ' ' . $str2;
    }
    if ($num >= 5) {
        return $num . ' ' . $str3;
    }
    return 'False';
}
$num = 1;
echo my_func_9($num, 'яблоко', 'яблока', 'яблок');
echo '<hr />';
/*10. Дан массив с числами. Выведите последовательно его элементы
используя рекурсию и не используя цикл.*/
echo '---задание 10---'.'<br>';
$arr = range(0,10);
my_func_10($arr);
function my_func_10($arr)
{
    echo array_shift($arr) . '<br>'; //array_shift- Извлекает первый элемент массива
    if (!empty($arr)){               //empty — Проверяет, пуста ли переменная
        my_func_10($arr);
    } else {
        return;
    }
}

echo '<hr />';
/*11. Дано число. Сложите его цифры. Если сумма получилась более 9-ти,
опять сложите его цифры. И так, пока сумма не станет однозначным числом
(9 и менее).*/
echo '---задание 11---'.'<br>';

function my_func_11($number)
{
    $sum = getDigitsSum($number);

    if ($sum <=9) return $sum;
    else 
    return my_func_11($sum);

}

echo my_func_11(2025);
echo '<hr />';
/*12. Рассчитать скорость движения машины и выведите её в удобочитаемом
виде. Осуществить возможность вывода в км/ч, м/c. Представить решение
задачи с помощью одной функции.*/
echo '---задание 12---'.'<br>';
function my_func_12($s, $t, $var){     //путь, время, выбор расчета в км.ч или м.с 
    $speed[1] = $s / $t . " км/ч";
    $speed[2] = $speed[1] / 3.6 . " м/с";
    return $speed[$var];
    }
    echo my_func_12(70, 2, 1);
    echo '<hr />';
/*13. Даны 2 слова, определить можно ли из 1ого слова составить 2ое, при
условии что каждую букву из строки 1 можно использовать только один раз.*/
echo '---задание 13---'.'<br>';;

function my_func_13($word1, $word2)
{

    $word1 = preg_split("/[\s,]+/", $word1); 
    $word2 = preg_split("/[\s,]+/", $word2);  
    $razlichie = array_diff($word1, $word2);
    
    
   foreach($razlichie as $value)
  {

  }
  
  if ($razlichie ==! true) {
   	echo "mozhno";
  } else {
  	echo "nelzya";
  }

}
my_func_13('lyuboe slovo', 'slovo');
echo '<hr />';
/*14. Палиндромом называют последовательность символов, которая читается
как слева направо, так и справа налево. Напишите функцию по определению
палиндрома по переданному параметру.*/
echo '---задание 14---'.'<br>';

function my_func_14($slovo)
{
    if ($slovo == strrev($slovo)) { //Переворачивает строку задом наперёд
        echo $slovo . ' - ' . "palindrom";
    } else {
        echo $slovo . ' - ' . "ne palindrom";
    }

}

echo my_func_14("level");
echo '<hr />';
/*15. Создание функцию создания таблицы умножения в HTML-документе в
виде таблицы с использованием соотв. тегов.*/
/*16. Дана строка с текстом. Напишите функцию определения самого длинного
слова.*/
echo '---задание 16---'.'<br>';

function my_func_16($string)
{
    $word = '';
    $string = explode(' ', $string); // разбивает строки

    foreach ($string as $value) {
        if (strlen($word) < strlen($value)) {
            $word = $value;
        }
    }

    return $word;
}

echo my_func_16("В заданной строке определить самое длинное");
echo '<hr />';
/*17. Напишите функцию определения суммарного количества единиц в числах
от 1 до 100.*/
echo '---задание 17---'.'<br>';

function my_func_17($numbersum)
{
    $count = 0;

    for ($i = 1; $i <= 3; $i++) {
        if (strripos("$i", "$numbersum") !== false)
            $count++;
    }

    return $count;
}

echo my_func_17(4);
echo '<hr />';
/*18. Напишите функцию, которая разбивает длинную строку тегами <br> так,
чтобы длина каждой подстроки была не более N символов. Новая подстрока
не должна начинаться с пробела.*/
?>